# Итоговая контрольная работа по основному блоку

## _**Задача:**_

*Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*


### _Описание кода:_

1. Добавлен Метод void `PrintString`

    данный метод, перебирает все элементы массива и выводит их в консоль.

```C#
    void PrintString(string[] array)
    {
        for(int i = 0; i < array.Length; i++)
        {
            Console.Write(array[i] + ", ");
        }
        Console.WriteLine();
    }
```

2.  В начале программы, Пользователь, через консоль задает размер массива `(n)`, и вводит данные строки каждого элемента. В конце блока заданный массив с помощью метода `PrintString`, выводится на консоль.

```C#
System.Console.Write("Введите размер массива - ");
int n = int.Parse(Console.ReadLine());
string[] array = new string[n];

for (int i = 0; i < n; i++)
{
    System.Console.Write($"Введите элемент {i}: ");
    array[i] = Console.ReadLine();
}

System.Console.Write("Задан Массив: ");
PrintString(array);
```

3. Для формирования второго масcива, с элементами описанными в условии задачи, необходимо создать второй массив. Что бы избежать лишних, пустых элементов массива, создаем переменную `size` (выступающая в качестве счетчика), и с помощью цикла `for`и, перебираем все элементы введенного массива, подходящие под условия `if`, добавляем в счетчик `size`.

```C#
int size = 0;
for (int i = 0; i < array.Length; i++)
{
    if (array[i].Length <= 3)
    {
        size++;
    }
}
```

4. В последнем блоке программы, задается второй массив, размером `size`, определенный в предыдущем блоке. Циклом `for`. проходимся по всем элементам первого массива и отбираем элементы подходящие по условия задачи (условия: *длина элементов меньше, либо равна 3 символам*) и добавляем их в выще заданную переменную `count`. После чего методом `PrintString`, выводи новый массив в консоль.

```C#
string[] array2 = new string[size];
int count = 0;

for (int i = 0; i < array.Length; i++)
{
    if (array[i].Length <= 3)
    {
        array2[count] = array[i];
        count++;
    }
}

System.Console.Write("Новый Массив, состоящий из элементов длина которых меньше, либо равна 3 символам: ");
PrintString(array2);
```